# Local IspellDict: en
#+Title: Infrastructure for Innovation
#+SubTitle: ii.nz
#+Author: Hippie Hacker
#+DESCRIPTION: Cloud Native Canvas
#+REVEAL_TALK_URL: https://ii.nz
#+KEYWORDS: ii, presentation, HTML, slide show
** Publish Me :noexport:
#+begin_src shell
scp README_client.html ii@ii.nz:/home/ii/public_html/index.html
scp README.html ii@ii.nz:/home/ii/public_html/presenter.html
# scp nz.css ii@ii.nz:/home/ii/public_html/nz.css
rsync -a images/ ii@ii.nz:/home/ii/public_html/images/
# rsync -a videos/ ii@ii.nz:/home/ii/public_html/videos/
#+end_src

#+RESULTS:
#+begin_example
#+end_example

** Get a token
#+begin_src shell
curl -s https://multiplex.ii.nz/token | jq .
#+end_src

#+RESULTS:
#+begin_example
{
  "secret": "16233631494111650796",
  "socketId": "fafd1b8ce3f4a4d3"
}
#+end_example

*** Cache fix my street
#+begin_src shell
rm -rf ~/public_html/fixmystreet
cd ~/public_html
mkdir fixmystreet
cd fixmystreet
wget -rkp -l3 -np -nH --cut-dirs=1 https://fixmystreet.org.nz/council/tauranga-city
cd fixmystreet
mv tauranga-city index.html
#+end_src

#+RESULTS:
#+begin_example
#+end_example

